1
//какие типы встроенных всплывающих окон в js вы знаете?

//окно предупреждения, окно подтверждения и окно запроса.

2
//выведите всплывающее окно с предупреждением 'Осторожно'

//Alert, confirm, promt

3
//выведите всплывающее окно с кнопками подтверждения и отмены

//alert, confirm, promt

4
//выведите всплывающее окно с вопросом и возможностью записать ответ

5
//какое временное событие выполняется после ожидания указанного количества миллисекунд?

//setTimeout

6
//какое временное событие непрерывно повторяет выполнение функции?

//setInterval

7
//выведите в консоли сообщение 'НАЧАЛО' с помощью setTimeout

8
//выведите в консоли сообщение 'ПОВТОР' с помощью setInterval каждые 2 секунды

9
//что такое куки?

//это данные, которые хранятся на вашем компьютере в небольших текстовых файлах.

10
//как создать куки файл?
document.cookie = 'userName = Ughur Madinali'

11
//как изменить ранее записанный куки?
document.cookie = 'userName = Ughur Madinali , expires=Wed, 14 April 2000, 00:00:00 UTC'

12
//как удалить ранее записанный куки?
document.cookie = 'userName = , expires=Wed, 17 Aug 2012, 00:00:00 UTC'